def permutation(n:int,i:int,j:int):
    p = [[1 if i_loop== j_loop else 0 for j_loop in range(n) ] for i_loop in range(n)]
    p[i],p[j] =p[j],p[i]
    return p



print(permutation(5,3,0))

'''
ماتریس پرمیوتیشن یک ماتریس مربع است
از دیدگاه سطری در هر سطر فقط یک مقدار یک وجود دارد وب قیه صفر هستن و از دیدگاه ستونی در هر ستون یک مقدار یک وجود دارد وبقیه صفر هستن
به عبارت دیگر در هر سطر یا ستون فقط یک مقدار یک وجود دارد و بقیه اعضای سطر یا ستون صفر است
اگر در یک ماتریس ضرب شد سطر ها (از دیدگاه سطری) یا ستون ها (از دیدگاه ستونی) جابهجا میکند.
می توانیم بگویم ماتریس پرمیوتیشن یک ماتریس ایدنتدی هست که سطر های ان(از دیگدگاه سطری) یا ستونهای آن(دیدگاه ستونی( جابه جا) شده است. 

'''
#ramin rowshan 9732491